Repository: abelsiqueira/perprof-py
Catalog: perprof/locale/*/LC_MESSAGES/perprof.po
Languages: pt

source: ERROR: File {} exists. Use `-f` to overwrite
pt: ERROR: Arquivo {} existe. Utilize `-f` para sobrescrever.

source: Performance Profile
pt: Perfil de Desempenho

source: Performance Ratio
pt: Razão de Desempenho

source: Problems solved
pt: Problemas resolvidos

source: RGB for background must have 3 integers
pt: RGB para a cor do fundo deve ser 3 inteiros

source: RGB for page background must have 3 integers
pt: RGB para a cor da página deve ser 3 inteiros

source: Output option {} not supported by matplotlib
pt: Opção de saída {} não suportada pela matplotlib

source: Output option {} not supported by TikZ
pt: Opção de saída não suportada pelo TikZ

source: --raw does not support output except standard output
pt: --raw apenas suporta como saída o terminal

source: ERROR: Subset is empty
pt: ERRO: Subconjunto é vazio

source: A python module for performance profiling (as described by Dolan and Moré).
pt: Um módulo Python para perfis de desempenho (como descrito por Dolan e Moré).

source: Backend options
pt: Opções de backend

source: Use matplotlib as backend for the plot. Default output: PNG
pt: Utiliza matplotlib como backend para o gráfico. Padrão de saída: PNG

source: Use LaTex/TikZ/pgfplots as backend for the plot. Default output: PDF
pt: Utiliza LaTeX/TikZ/pgfplots como backend para o gráfico. Padrão de saída: PDF

source: Print raw data. Default output: standard output
pt: Imprimir dado bruto. Padrão de saída: terminal

source: Output formats
pt: Formatos de saída

source: The output file will be a EPS file
pt: O arquivo de saída será um EPS

source: The output file will be a PDF file
pt: O arquivo de saída será um PDF

source: The output file will be a PNG file
pt: O arquivo de saída será um PNG

source: The output file will be a (La)TeX file
pt: O arquivo de saída será um código (La)TeX

source: Create the header as a standalone to the tex file, enabling compilation of the result
pt: Criar um cabeçalho para o arquivo TeX e compilá-lo

source: Set pgfplots backwards compatibility mode to given version
pt: Configurar versão de compatibilidade do pgfplots

source: Set language for axis label
pt: Configurar língua dos título dos eixos

source: When parsing file handle all non `c` character as `d`
pt: No parse aceitar caracteres além do `c` e `d`

source: Print output of pdflatex
pt: Imprimir saída do pdflatex

source: Use only black color.
pt: Utilizar apenas as cores preto e branco

source: RGB values separated by commas for the background color of the plot. (Values in the 0,255 range)
pt: Valores do RGB separados por vírgula para a cor de fundo do gráfico. (Valores no intervalo 0,255)

source: RGB values separated by commas for the background color of the page. (Values in the 0,255 range)
pt: Valores do RGB separados por vírgula para a cor da página do gráfico. (Valores no intervalo 0,255)

source: Use logarithmic scale for the x axis of the plot
pt: Utilizar escala logarítmica para o eixo x do gráfico

source: Flags that are interpreted as success, separated by commas. Default: `c`
pt: Palavras que serão interpretadas como sucesso, separadas por vírgula. Padrão: `c`

source: Sets a maximum time for a solved problem. Any problem with a time greater than this will be considered failed.
pt: Configurar um tempo máximo de execução. Qualquer problema que utilizarmais que esse tempo será considerado como falha.

source: Sets a minimum time for a solved problem. Any problem with a time smaller than this will have the time set to this.
pt: Configurar um tempo máximo de execução. Qualquer problema que utiliza menos que esse tempo terá o tempo alterado para esse valor.

source: Choose the type of comparison to be made.
pt: Escolha o tipo de comparação a ser feita.

source: Set the problems to unconstrained, which implies that there is no primal feasibility to check.
pt: Marca os problemas como irrestrito, implicando que não existe factibilidad primal para verificar.

source: Tolerance for the primal and dual infeasibilities
pt: Tolerância para as factibilidades primal e dual.

source: Enable cache.
pt: Habilitar cache

source: Name of a file with a subset of problems to compare
pt: Nome do arquivo com subconjunto de problemas a serem comparados

source: Limit the x-axis based this value
pt: Limite do eixo x

source: Force overwrite the output file
pt: Forçar sobre escrever o arquivo de saída

source: Name of the file to use as output (the correct extension will be add)
pt: Nome do arquivo de saída (a extensão correta será adicionada)

source: Use examples files as input
pt: Utiliza arquivos de exemplos como entrada

source: The name of the files to be used for the performance profiling (for demo use `--demo`)
pt: Nome dos arquivos a serem utilizados no perfil de desempenho (para demonstranstração utilize `--demo`)

source: Using demo mode. Ignoring input files.
pt: Utilizando mode de demonstração. Ignorando arquivos de entrada.

source: You must provide at least two input files.
pt: Você deve informar pelo menos dois arquivos de entrada.

source: ERROR: When using PDF output, you need to provide the name of the output file.
pt: ERRO: Ao utilizar a saída para PDF é necessário informar o arquivo de saída

source: ERROR when reading line #{} of {}: {}
pt: ERRO ao ler linha #{} de {}: {}

source: is not a valid option for YAML.
pt: não é uma opção válida para YAML.

source: This line must have at least 2 elements.
pt: Essa linha precisa ter pelo menos 2 elementos.

source: Duplicated problem:
pt: Problema duplicado:

source: Problem has no time/cost:
pt: Problema não tem tempo/custo:

source: Column for primal or dual is out of bounds
pt: Coluna para primal ou dual está fora dos limites

source: Column for fval is out of bounds
pt: Coluna para fval está fora dos limites

source: Time spending can't be zero.
pt: Tempo gasto não pode ser zero.

source: This line must have at least 3 elements.
pt: Essa linha precisa ter pelo menos 3 elementos.

source: The second element in this lime must be {} or d.
pt: Segundo elemento nessa linha deve ser {} ou d.

source: The parser option 'compare' should be 'exitflag' or 'optimalvalues'
pt: A opção do 'compare' deve ser 'exitflag' ou 'optimalvalues'

source: ERROR: List of problems (intersected with subset, if any) is empty
pt: ERRO: Lista de problema é vazia

source: ERROR: problem set is empty
pt: ERRO: conjunto de problemas é vazio

source: ERROR:
pt: ERRO:

source: has no solved problems. Verify the 'success' flag.
pt: não tem problemas resolvida. Verifique a opção 'success'.

source: ERROR: File {} exists. Use `-f` to overwrite.
pt: ERROR: Arquivo {} existe. Utilize `-f` para sobrescrever.
